app/views/events/_form.html.erb

SELECT "categories".* FROM "categories"
---
     <li>
        <%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) %>