app/views/events/show.html.erb

  <h3>Registrations</h3>
  <%= link_to pluralize(@event.registrations.size, 'registration'),
              event_registrations_path(@event) %>
---
SELECT COUNT(*) FROM "registrations"  WHERE "registrations"."event_id" = ?  [["event_id", 1]]