app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "likes".* FROM "likes"  WHERE "likes"."user_id" = ? AND "likes"."event_id" = 3 LIMIT 1  [["user_id", 7]]
---
  def show
    @event = Event.find(params[:id])
    @likers = @event.likers


    if current_user
      @current_like = current_user.likes.find_by(event_id: @event.id)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "events" SET "name" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["name", "Updated Event Name"], ["starts_at", "2014-11-15 17:36:00.000000"], ["updated_at", "2014-11-05 17:36:24.157341"]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save