app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-17 04:32:41.386674"], ["event_id", 3], ["updated_at", "2015-03-17 04:32:41.386674"], ["user_id", 7]]
---
	def create
		@event.likes.create!(user: current_user)

SELECT  "likes".* FROM "likes"  WHERE "likes"."user_id" = ? AND "likes"."id" = ? LIMIT 1  [["user_id", 7], ["id", 15]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 15]]
---
   def destroy
		like = current_user.likes.find(params[:id])
		like.destroy